docs/knowcode/20260524T140000--architecture-overview__arch_iel_expense.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-24 lhd 14:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Architecture Overview - IEL Expense Tracker</title>
<meta name="author" content="RARINONY MANANDRATRA Joliot" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Architecture Overview - IEL Expense Tracker</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org65995f5">1. Introduction</a></li>
<li><a href="#orgc26a9ab">2. Composants Principaux</a>
<ul>
<li><a href="#org95b5087">2.1. Modèles de Données</a></li>
<li><a href="#orgfff5cef">2.2. Persistance (DatabaseHelper)</a></li>
<li><a href="#orgdb6a9b2">2.3. Gestion d'État (Providers)</a></li>
<li><a href="#org39357bf">2.4. Interface Utilisateur (Views &amp; Widgets)</a></li>
</ul>
</li>
<li><a href="#org56b39eb">3. Flux de Données</a></li>
</ul>
</div>
</div>
<div id="outline-container-org65995f5" class="outline-2">
<h2 id="org65995f5"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
L'application "IEL - Expense tracker" (CaisseCash) est un outil de gestion de finances personnelles et de petite entreprise (TPE) développé avec Flutter. Elle permet de suivre les flux de trésorerie (Entrées/Sorties), de gérer des portefeuilles et de visualiser l'évolution financière via des graphiques.
</p>
</div>
</div>
<div id="outline-container-orgc26a9ab" class="outline-2">
<h2 id="orgc26a9ab"><span class="section-number-2">2.</span> Composants Principaux</h2>
<div class="outline-text-2" id="text-2">
<p>
La structure suit une architecture en couches (Layered Architecture) simplifiée, adaptée à Flutter et Riverpod :
</p>
</div>
<div id="outline-container-org95b5087" class="outline-3">
<h3 id="org95b5087"><span class="section-number-3">2.1.</span> <a href="20260524T140100--data-model-transaction__model_data.html">Modèles de Données</a></h3>
<div class="outline-text-3" id="text-2-1">
<p>
Définit les entités métier (Transaction, Wallet).
</p>
</div>
</div>
<div id="outline-container-orgfff5cef" class="outline-3">
<h3 id="orgfff5cef"><span class="section-number-3">2.2.</span> <a href="20260524T140200--persistence-database-helper__service_db.html">Persistance (DatabaseHelper)</a></h3>
<div class="outline-text-3" id="text-2-2">
<p>
Gère la base de données SQLite locale, les migrations et les opérations CRUD.
</p>
</div>
</div>
<div id="outline-container-orgdb6a9b2" class="outline-3">
<h3 id="orgdb6a9b2"><span class="section-number-3">2.3.</span> <a href="20260524T140300--state-management-riverpod__provider_logic.html">Gestion d'État (Providers)</a></h3>
<div class="outline-text-3" id="text-2-3">
<p>
Utilise Riverpod pour exposer les données de la base de données de manière asynchrone à l'interface utilisateur.
</p>
</div>
</div>
<div id="outline-container-org39357bf" class="outline-3">
<h3 id="org39357bf"><span class="section-number-3">2.4.</span> Interface Utilisateur (Views &amp; Widgets)</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li><b>MainScreen</b> : Dashboard principal avec résumé et navigation.</li>
<li><b>HistoryView</b> : Liste filtrable des transactions.</li>
<li><b>Charts</b> : Visualisation de l'évolution et de la distribution des dépenses.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org56b39eb" class="outline-2">
<h2 id="org56b39eb"><span class="section-number-2">3.</span> Flux de Données</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>L'utilisateur saisit une transaction via <b>AddTransactionDialog</b>.</li>
<li>Le <b>TransactionProvider</b> appelle <b>DatabaseHelper</b> pour persister la donnée.</li>
<li>Les providers dépendants (summary, evolution) sont invalidés et se rechargent automatiquement.</li>
<li>L'UI réagit au changement d'état des providers.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: RARINONY MANANDRATRA Joliot</p>
<p class="date">Created: 2026-05-24 lhd 14:22</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
